<?php
	// $a = 10;
	// $b = 20;
	// echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";
	// $b = 30;
	// echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";

	// echo "---------------------------------------";
	

	// $a = 10;
	// $b = $a;
	// echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";

	// $a = 20;
	// echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";

	
	$a = 10;
	$b = &$a;
	echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";

	$a = 40;			
	// unset( $a );
	unset( $b );
	echo "a的值是:" . $a . " " . "b的值是:" . $b . "<br/>";

?>